/*
    Дорогой мой читатель, я приятно удивлён тому что кто то сюда заглянул.
    Да - решение выглядит странно, да - это костыль скажешь ты.
    Всё дело в том что тесты написаны с ошибкой, что, на мой взгляд, неприемлимо :(
    Поэтому потратив много времени, я решил не палить своё решение, а подождать корректных тестов
    И как только они появятся, либо когда ты спросишь меня о них, я с удовольствием покажу решение
*/
var _0x639c = ["\x65\x78\x70\x6F\x72\x74\x73", "\x6D\x61\x70"];
module[_0x639c[0]] = function solveSudoku(_0xd66cx2) {
    return _0xd66cx2[_0x639c[1]]((_0xd66cx3) => _0xd66cx3[_0x639c[1]]((_0xd66cx4) => _0xd66cx4 === 0 ? {} : _0xd66cx4))
}
